```
CVM apply & update renew flag

terraform apply
2020/05/15 15:19:10 [WARN] Log levels other than TRACE are currently unreliable, and are supported only for backward compatibility.
  Use TF_LOG=TRACE to see Terraform's internal logs.
  ----
tencentcloud_key_pair.random_key: Refreshing state... [id=skey-iadwe0d7]
data.tencentcloud_availability_zones.my_favorate_zones: Refreshing state...
data.tencentcloud_images.my_favorate_image: Refreshing state...
data.tencentcloud_instance_types.my_favorate_instance_types: Refreshing state...

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_instance.foo[0] will be created
  + resource "tencentcloud_instance" "foo" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-guangzhou-3"
      + create_time                             = (known after apply)
      + disable_monitor_service                 = true
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-1u6l2i9l"
      + instance_charge_type                    = "PREPAID"
      + instance_charge_type_prepaid_period     = 1
      + instance_charge_type_prepaid_renew_flag = "NOTIFY_AND_AUTO_RENEW"
      + instance_name                           = "terraform-brickzzhang-testing"
      + instance_status                         = (known after apply)
      + instance_type                           = "S1.SMALL1"
      + internet_charge_type                    = "TRAFFIC_POSTPAID_BY_HOUR"
      + internet_max_bandwidth_out              = 2
      + key_name                                = "skey-iadwe0d7"
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + vpc_id                                  = (known after apply)

      + data_disks {
          + data_disk_id         = (known after apply)
          + data_disk_size       = (known after apply)
          + data_disk_type       = (known after apply)
          + delete_with_instance = (known after apply)
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

tencentcloud_instance.foo[0]: Creating...
tencentcloud_instance.foo[0]: Still creating... [10s elapsed]
tencentcloud_instance.foo[0]: Creation complete after 11s [id=ins-cbtb9kxs]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.

```